- Generally Ml models developrd by math(numbers)

- so it's become very important that we will convert categorical column to Numerical column, taaki Ml model vo samaj sake

- till now we learn analysis but now we are transforming the data

- this method is called **Encoding**

- Here big question is why we are transforming the data?
- ==> beacuse Ml model understand the numerical data

- for eg. ml model will not understand who male and female

- humae unnahe kuch numbers deen honhge

- like.  Male = 0 , Female = 1 and aab ml model will understand who is male and female

- and isse ko he to hum encoding kahate hai

- Feature Analysis: first 5 Sessions

- Feature Engineering: Transform the data

- Feature Selection: Machine learning

- So we will follow below apporach

- Feature Analysis: so feature analysis me humane bar chart,pie chart,frequency tables multivaraite, bivariateko samjha

- Feature Engineering: and feature engineering me hum transformation of the data ko samjhange jisse hum Encoding bhi khahate hai

- for eg. converting not  normal distribution to distribution, convert categorical to numerical,scaling etc

- Feature Selection: and feature seleaction ka matlab hum Machine learning me sikhange


- So ultimately whenever we develop Ml model All data should be in the ml model

- Before Model Development

- We will do EDA : Exploratary data analysis

    - Features(column) analysis

        - categorical, numerical,outlier analysis, Bivariate, Multivariate

        - we will get this insights

- Feature Engineering

    - we will modify the data

    - Models developed by math

    - Encoding: Convert categorical data to numerical data

    - Scaling : All the math developed by assumption by data follows normal distribution

    - Convert skewed distribution to normal

- Feature Selection

- Map

- Label Encoder

- OneHotEnoder

## Map

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns


path=r'C:\Users\LENOVO\Documents\Naresh IT\EDA\Visadataset.csv'           
visa_df=pd.read_csv(path) 
visa_df


cat=visa_df.select_dtypes(include='object').columns
num=visa_df.select_dtypes(exclude='object').columns

In [3]:
path=r'C:\Users\LENOVO\Documents\Naresh IT\EDA\Visadataset.csv'           
visa_df=pd.read_csv(path) 
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [4]:
# now firstly pick case_status column
visa_df['case_status']

0           Denied
1        Certified
2           Denied
3           Denied
4        Certified
           ...
25475    Certified
25476    Certified
25477    Certified
25478    Certified
25479    Certified
Name: case_status, Length: 25480, dtype: object

In [5]:
# now check how many unique values are avaliable in case_status
visa_df['case_status'].unique()
# so here is two unique values are avaliable  [Denied,Certified]

array(['Denied', 'Certified'], dtype=object)

In [6]:
# Now create a dictionary assign a number start with zero
# for each label based on alphabetical order 
d={'Certified':0,'Denied':1}       # so this is called alphabetical order
d

{'Certified': 0, 'Denied': 1}

In [7]:
# now i want to change case_status
# for that purpose map the dictionary with column

In [8]:
# so our column name is visa_df[case_status],first use this 
# then use dot map(), and in brackets give our dictionary name
# just like this

visa_df['case_status'].map(d)

# Note: here we can write like this visa_df['case_status1'].map(d)
# yahe pe humane case_status1 naam ka naya column kiya hai 
# but issme problem yaha hai ki later in Ml ke analysis ke wakt 
# hume puranae case_status column ko drop karna hoga
# isse accha hum naya column lange hi nahi and purane column ko hi rakhange
# jisse purana column hee override ho jayega

0        1
1        0
2        1
3        1
4        0
        ..
25475    0
25476    0
25477    0
25478    0
25479    0
Name: case_status, Length: 25480, dtype: int64

In [9]:
visa_df['case_status']=visa_df['case_status'].map(d)
# now don't run this code again beacuse it is already override 
# if we run again it will not good

In [10]:
visa_df
# now in the output, in  the case_status column 'Certified','Denied' is overwrite with 0,1
# check it

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,0
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,0
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,0
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,0
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,0

In [11]:
# Do all together


# Step-1:
path=r'C:\Users\LENOVO\Documents\Naresh IT\EDA\Visadataset.csv'           
visa_df=pd.read_csv(path)


# Step-2: 
visa_df['case_status'].unique()


#Step-3:
visa_df['case_status']=visa_df['case_status'].map(d)

In [12]:
# now mujhe aab continent column lena hai and usske unique value nikalkar 
# usse numbering dene hai(0,1,2,etc)
# so visa_['continent']  ke sath vahi karna hai jo visa_case_status ke sath kiya atha

In [13]:
# now  continent column me numerious unqique value haii 
# and usee numbering dena kaafi hard hai that's why use for loop

In [14]:
visa_df['continent'].unique()
d={}
d['Asia']=0
d['Africa']=1
d
# so in the above example we took empty dictionary and we add up with asia=0,africa=1
# so here what is common and what is changing
# and here asia africa is changing and jaisse jaisse ye asia,africa change ho raha hai vaise hi unake samane ki numbering bhi change ho rahi hai

{'Asia': 0, 'Africa': 1}

In [15]:
labels=visa_df['continent'].unique()
d={}
for i in range(len(labels)):
    key=labels[i]
    d[key]=i

d

{'Asia': 0,
 'Africa': 1,
 'North America': 2,
 'Europe': 3,
 'South America': 4,
 'Oceania': 5}

In [16]:
labels=sorted(visa_df['continent'].unique())
d={}
for i in range(len(labels)):
    key=labels[i]
    d[key]=i

d

{'Africa': 0,
 'Asia': 1,
 'Europe': 2,
 'North America': 3,
 'Oceania': 4,
 'South America': 5}

In [17]:
# now do dict comphrension of above code

labels=sorted(visa_df['continent'].unique())
d={labels[i]:i for i in range (len(labels))}
d

{'Africa': 0,
 'Asia': 1,
 'Europe': 2,
 'North America': 3,
 'Oceania': 4,
 'South America': 5}

In [18]:
# do all together

path=r'C:\Users\LENOVO\Documents\Naresh IT\EDA\Visadataset.csv'           
visa_df=pd.read_csv(path) 

labels=sorted(visa_df['continent'].unique())
d={labels[i]:i for i in range (len(labels))}

visa_df['continent']=visa_df['continent'].map(d)

In [19]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,1,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,1,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,1,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,0,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,1,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,1,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,1,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,1,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [20]:
# path=r'C:\Users\LENOVO\Documents\Naresh IT\EDA\Visadataset.csv'           
# visa_df=pd.read_csv(path) 

# labels=sorted(visa_df['continent'].unique())
# d={labels[i]:i for i in range (len(labels))}

# visa_df['continent']=visa_df['continent'].map(d)

# so in this code what is common and what is changing

In [21]:
path=r'C:\Users\LENOVO\Documents\Naresh IT\EDA\Visadataset.csv'           
visa_df=pd.read_csv(path) 

cat=visa_df.select_dtypes(include='object').columns
for i in cat:
    labels=sorted(visa_df[i].unique())
    d={labels[i]:i for i in range (len(labels))}
    
    visa_df[i]=visa_df[i].map(d)

visa_df

# so this is first method which is map method
# now there is a another method which is shortcut called LabelEncoder

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,0,1,2,0,0,14513,2007,4,592.2029,0,1,1
1,1,1,3,1,0,2412,2002,2,83425.6500,3,1,0
2,2,1,0,0,1,44444,2008,4,122996.8600,3,1,1
3,3,1,0,0,0,98,1897,4,83434.0300,3,1,1
4,4,0,3,1,0,1082,2005,3,149907.3900,3,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,17204,1,0,1,1,2601,2008,3,77092.5700,3,1,0
25476,17205,1,2,1,0,3274,2006,2,279174.7900,3,1,0
25477,17206,1,3,1,0,1121,1910,3,146298.8500,3,0,0
25478,17207,1,3,1,1,1918,1887,4,86154.7700,3,1,0
25479,17209,1,0,1,0,3195,1960,1,70876.9100,3,1,0

**LabelEncoder**

-Package name: **sklearn**

    class: **preprocessing**

            - metod: **labelEncoder**

- now whenever we see these above three steps do like this


    - from sklearn.preprocessing import LabelEncoder

- Step-1: import the method == from sklearn.preprocessing import LabelEncoder

- Step-2: save the method == le=LabelEncoder()

- step-3: apply fit transform == le.fit_transform

In [22]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
le.fit_transform


# Now what is the meanibg of fit_transform?
# => here, there are two operations
# 1) Fit: Fit means finding something
#         here we are finding dictionary
# 2) transform: transform means we are changing the data
#               for eg. using the dictionary we are changing English to number

**fit transform**

- fit: finding something
    
    - first we are finding dictionary
      
- transform: change the data
    
    - using the dictionary we are changing English to number

In [28]:
from sklearn.preprocessing import LabelEncoder
path=r'C:\Users\LENOVO\Documents\Naresh IT\EDA\Visadataset.csv'           
visa_df=pd.read_csv(path) 

le=LabelEncoder()
le.fit_transform(visa_df['case_status'])

array([1, 0, 1, ..., 0, 0, 0])

In [29]:
# or
from sklearn.preprocessing import LabelEncoder
path=r'C:\Users\LENOVO\Documents\Naresh IT\EDA\Visadataset.csv'           
visa_df=pd.read_csv(path) 

le=LabelEncoder()
visa_df['case_status']=le.fit_transform(visa_df['case_status'])

In [30]:
# now again see what is common and what is changing in above code


from sklearn.preprocessing import LabelEncoder
path=r'C:\Users\LENOVO\Documents\Naresh IT\EDA\Visadataset.csv'           
visa_df=pd.read_csv(path) 

le=LabelEncoder()
le.fit_transform(visa_df['case_status'])
for i in cat:
    visa_df[i]=le.fit_transform(visa_df[i])

In [31]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,0,1,2,0,0,14513,2007,4,592.2029,0,1,1
1,1,1,3,1,0,2412,2002,2,83425.6500,3,1,0
2,2,1,0,0,1,44444,2008,4,122996.8600,3,1,1
3,3,1,0,0,0,98,1897,4,83434.0300,3,1,1
4,4,0,3,1,0,1082,2005,3,149907.3900,3,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,17204,1,0,1,1,2601,2008,3,77092.5700,3,1,0
25476,17205,1,2,1,0,3274,2006,2,279174.7900,3,1,0
25477,17206,1,3,1,0,1121,1910,3,146298.8500,3,0,0
25478,17207,1,3,1,1,1918,1887,4,86154.7700,3,1,0
25479,17209,1,0,1,0,3195,1960,1,70876.9100,3,1,0

**OneHotEncoder**

**OneHotEncoder**

- The method name is : pd.get_dummies

|-|`
|Denied|
|Ceritifed|

|case_status|
|-|
|Denied|
|Certified|

|case_status|case_status_denied|case_status_Certified|
|-|-|-|
|Denied|1|0|
|Certified|0|1|

In [ ]:
continent   Continent_asia     Continent_africa      Continent_Europe
asia            1                    0                       0
africa          0                    1                       0
Europe          0                    0                       1

In [27]:
path=r'C:\Users\LENOVO\Documents\Naresh IT\EDA\Visadataset.csv'           
visa_df=pd.read_csv(path) 

pd.get_dummies(visa_df['continent'])

       Africa   Asia  Europe  North America  Oceania  South America
0       False   True   False          False    False          False
1       False   True   False          False    False          False
2       False   True   False          False    False          False
3       False   True   False          False    False          False
4        True  False   False          False    False          False
...       ...    ...     ...            ...      ...            ...
25475   False   True   False          False    False          False
25476   False   True   False          False    False          False
25477   False   True   False          False    False          False
25478   False   True   False          False    False          False
25479   False   True   False          False    False          False

[25480 rows x 6 columns]

In [28]:
visa_df['continent'].values

array(['Asia', 'Asia', 'Asia', ..., 'Asia', 'Asia', 'Asia'], dtype=object)

In [29]:
path=r'C:\Users\LENOVO\Documents\Naresh IT\EDA\Visadataset.csv'           
visa_df=pd.read_csv(path) 

pd.get_dummies(visa_df['continent'],
              dtype=int)

       Africa  Asia  Europe  North America  Oceania  South America
0           0     1       0              0        0              0
1           0     1       0              0        0              0
2           0     1       0              0        0              0
3           0     1       0              0        0              0
4           1     0       0              0        0              0
...       ...   ...     ...            ...      ...            ...
25475       0     1       0              0        0              0
25476       0     1       0              0        0              0
25477       0     1       0              0        0              0
25478       0     1       0              0        0              0
25479       0     1       0              0        0              0

[25480 rows x 6 columns]

**LabelEncoder Vs OneHotEncoder**

- Generally we don't want relation between input columns

- we need both input columns are **independent(X,Y)** each other

- we need both input column are perpendicular each other

- we need both input columns are **orthogonal** each other 

- we need both input columns are **90 degree phase shift** each other

- OneHotEncoder will acheive above

- But OneHotEncoder creates new columns

    - columns are increase means dimenssion are increase

    - More Dimension data need more procssing time

    - more dimension data need more infra

    - This is called **curse of Dimensionally**